Rayling35/STM32Cube_FW_L4_V1.12.0/Projects/B-L475E-IOT01A/Applications/BLE/HeartRate/Inc/config.h
/**
 ******************************************************************************
 * @file    config.h
 * @author  MCD Application Team
 * @brief   Application configuration file
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; Copyright (c) 2017 STMicroelectronics International N.V.
 * All rights reserved.</center></h2>
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted, provided that the following conditions are met:
 *
 * 1. Redistribution of source code must retain the above copyright notice, 
 *    this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 * 3. Neither the name of STMicroelectronics nor the names of other 
 *    contributors to this software may be used to endorse or promote products 
 *    derived from this software without specific written permission.
 * 4. This software, including modifications and/or derivative works of this 
 *    software, must execute solely and exclusively on microcontroller or
 *    microprocessor devices manufactured by or for STMicroelectronics.
 * 5. Redistribution and use of this software other than as permitted under 
 *    this license is void and will automatically terminate your rights under 
 *    this license. 
 *
 * THIS SOFTWARE IS PROVIDED BY STMICROELECTRONICS AND CONTRIBUTORS "AS IS" 
 * AND ANY EXPRESS, IMPLIED OR STATUTORY WARRANTIES, INCLUDING, BUT NOT 
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A 
 * PARTICULAR PURPOSE AND NON-INFRINGEMENT OF THIRD PARTY INTELLECTUAL PROPERTY
 * RIGHTS ARE DISCLAIMED TO THE FULLEST EXTENT PERMITTED BY LAW. IN NO EVENT 
 * SHALL STMICROELECTRONICS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
 * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, 
 * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF 
 * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING 
 * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 ******************************************************************************
 */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __CONFIG_H
#define __CONFIG_H

#ifdef __cplusplus
extern "C" {
#endif

#include "stm32l4xx_ll_pwr.h"

/**
 * This setting shall be set to 0 when BlueNRG is used as a coprocessor
 * It shall be set to 1 within a BLE SoC.
 */
#define CFG_BLE_HCI_STDBY   0



/******************************************************************************
 * HR CONFIGURATION
 ******************************************************************************/

/**< Advertising Interval */
#define CFG_HR_FAST_CONN_ADV_INTERVAL_MIN    (0x80)  /**< 80ms */
#define CFG_HR_FAST_CONN_ADV_INTERVAL_MAX    (0xA0)  /**< 100ms */
#define CFG_HR_LP_CONN_ADV_INTERVAL_MIN      (0x640) /**< 1s */
#define CFG_HR_LP_CONN_ADV_INTERVAL_MAX      (0xFA0) /**< 2.5s */

/**< IO capabilities  */
#define CFG_IO_CAPABILITY_DISPLAY_ONLY       (0x00)
#define CFG_IO_CAPABILITY_DISPLAY_YES_NO     (0x01)
#define CFG_IO_CAPABILITY_KEYBOARD_ONLY      (0x02)
#define CFG_IO_CAPABILITY_NO_INPUT_NO_OUTPUT (0x03)
#define CFG_IO_CAPABILITY_KEYBOARD_DISPLAY   (0x04)

#define CFG_HR_IO_CAPABILITY                  CFG_IO_CAPABILITY_DISPLAY_ONLY

/**< MITM modes  */
#define CFG_MITM_PROTECTION_NOT_REQUIRED      (0x00)
#define CFG_MITM_PROTECTION_REQUIRED          (0x01)

#define CFG_HR_MITM_PROTECTION                CFG_MITM_PROTECTION_REQUIRED




/**
 * This setting shall be set to '1' when the applications provided in the delivery
 * require the support of the client on the device
 */
#define GATT_CLIENT                                                           0

/**
 * This setting shall be set to '1' if the device needs to support the Peripheral Role
 * In the MS configuration, both BLE_CFG_PERIPHERAL and BLE_CFG_CENTRAL shall be set to '1'
 */
#define BLE_CFG_PERIPHERAL                                                    1

/**
 * This setting shall be set to '1' if the device needs to support the Central Role
 * In the MS configuration, both BLE_CFG_PERIPHERAL and BLE_CFG_CENTRAL shall be set to '1'
 */
#define BLE_CFG_CENTRAL                                                       0

/**
 * Define the BLE ATT_MTU size in bytes supported
 */
#define BLE_ATT_MTU_SIZE                                                     23

/**
 * When set to 1, it toggles a led on the remote
 * Max is (BLE_ATT_MTU_SIZE-3)
 */
#define DATA_NOTIFICATION_MAX_PACKET_SIZE                                     1

/**
 * When set to 1, it toggles a led on the remote
 * Max is 255
 * Note: The BlueNRG-MS supports 4 requests in the prepare queue
 */
#define DATA_CLI_WRITE_MAX_PACKET_SIZE                            (1*(BLE_ATT_MTU_SIZE-5))

/**
 * It requires the DATA TRANSFER to be enabled
 * The action is triggered on USER BUTTON
 * 0: packet is sent at max throughput
 * 1: packet is sent at regular basis (Timer)
 * 2: packet is sent on USER BUTTON event
 */
#define DATA_TX_MODE                                                           0

/* Define platform used: only ARM supported for TRACE trace */
#define CFG_PLATFORM_LINUX                                                    0x01)
#define CFG_PLATFORM_WINDOWS                                                 (0x02)
#define CFG_PLATFORM_ARM                                                     (0x03)

#define CFG_PLATFORM_TYPE                                               (CFG_PLATFORM_ARM)

/**
 * This the minimum of time before the next event of the timersver
 * required to enter OFF mode
 * The time is counted in ticks
 */
/**< 20ms */
#define TIMERSERVER_OFF_MODE_THRESHOLD                                (20000/CFG_TS_TICK_VAL)


/**
 * if 1 keep debugger enabled while in any low power mode
 * - should be set to 0 in production
 */
#define CFG_DEBUGGER_SUPPORTED                                                1

/**
 *  When set to 1, the low power mode is enable
 *  When set to 0, the device stays in RUN mode
 */
#define CFG_LPM_SUPPORTED                                                     1

/** tick timer value is us */
#define CFG_TS_TICK_VAL                                                      63

/**
 * BD_ADDRESSES
 */
#define CFG_ADV_BD_ADDRESS                                        0x5487102585ab


/**
 * Low Power Mode configuration
 * Only one the the three configuration shall be enabled
 *
 * Note1: The MSI configuration is not accurate enough to use the Debug Traces
 * over UART.
 *
 * Note2: For most application, the best power consumption is obtained when the SPI clock connected to the BlueNRG-MS
 * is set to its maximum speed 8Mhz.
 * The power consumption is better with MSI@16Mhz and SPI@8Mhz versus MSI@24Mhz and SPI@6Mhz.
 */
#define HSI_WITH_PLL                                                           0
#define HSI_WITHOUT_PLL                                                        0
#define MSI_WITHOUT_PLL                                                        1


#define HR_APPLICATION                                                         1
#define BLE_CFG_DATA_ROLE_MODE                                                 2



