Rayling35/STM32Cube_FW_L4_V1.12.0/Projects/B-L475E-IOT01A/Applications/BLE/HeartRate/Inc/config.h
typedef enum
{
  CFG_TimProcID_isr,
} CFG_TimProcID_t;

/**
 * Lowest to Highest priority when several tasks are pending
 * Max is 32
 */
typedef enum
{
  CFG_IdleTask_ConnMgr,
  CFG_IdleTask_MeasReq,
  CFG_IdleTask_HciAsynchEvt,
  CFG_IdleTask_TlEvt,
  CFG_TASK_NBR,                   /**< Shall be last in the list */
} CFG_IdleTask_Id_t;

#define CFG_SCH_TASK_NBR  CFG_TASK_NBR

/**
 * List of all events id supported in the application
 * Max is 32
 */
typedef enum
{
  CFG_IdleEvt_HciCmdEvtResp,
} CFG_IdleEvt_Id_t;


/**
 * This setting shall be set to '1' to run the PTS tests.
 * Otherwise, it shall be kept to '0'
 */
#define PTS_TEST                                                               0

/* For debug trace */
#define CFG_DEBUG_TRACE                                                        0

#if( CFG_DEBUG_TRACE == 1)
#undef CFG_LPM_SUPPORTED
#define CFG_LPM_SUPPORTED                                                      0

#undef CFG_DEBUGGER_SUPPORTED
#define CFG_DEBUGGER_SUPPORTED                                                 1
#endif


#define CFG_MAX_CONNECTION                                                     8

#if (PTS_TEST == 0)
//Platform 2
#define CONNECTED_BD_ADDRESS                                      0x11AA22BB33CC
#else
/* PTS BD Address */
#define CONNECTED_BD_ADDRESS                                      0x3E0B08DC1B00
//#define CONNECTED_BD_ADDRESS                                    0xA4B605DC1B00
#endif


/******************************************************************************
 * Menu for optionnal feature configuration
 ******************************************************************************/
#define BLE_CFG_MENU_DEVICE_INFORMATION                                        0
#define MENU_BATTERY                                                           0
#define MENU_ENV_SENSING                                                       0
#define MENU_GLUCOSE                                                           0

#define CFG_MENU                                          BLE_CFG_MENU_DEVICE_INFORMATION +\
        MENU_BATTERY            +\
        MENU_ENV_SENSING        +\
        MENU_GLUCOSE

/******************************************************************************
 *
 * BLE SERVICES CONFIGURATION
 *
 ******************************************************************************/
/**
 * There is one handler per service enabled
 * Note: There is no handler for the Device Information Service
 *
 * This shall take into account all registered handlers
 * (from either the provided services or the custom services)
 */
#define BLE_CFG_SVC_MAX_NBR_CB      5

#define BLE_CFG_CLT_MAX_NBR_CB      0

/******************************************************************************
 * Device Information Service (DIS)
 ******************************************************************************/
/**< Number of characteristic added by the user */
#define BLE_CFG_DIS_NUMBER_OF_CUSTOM_CHAR                                     0

/**< Options: Supported(1) or Not Supported(0) */
#define BLE_CFG_DIS_MANUFACTURER_NAME_STRING                                  1
#define BLE_CFG_DIS_MODEL_NUMBER_STRING                                       0
#define BLE_CFG_DIS_SERIAL_NUMBER_STRING                                      0
#define BLE_CFG_DIS_HARDWARE_REVISION_STRING                                  0
#define BLE_CFG_DIS_FIRMWARE_REVISION_STRING                                  0
#define BLE_CFG_DIS_SOFTWARE_REVISION_STRING                                  0
#define BLE_CFG_DIS_SYSTEM_ID                                                 0
#define BLE_CFG_DIS_IEEE_CERTIFICATION                                        0
#define BLE_CFG_DIS_PNP_ID                                                    0

/**
 * device information service characteristic lengths
 */
#define BLE_CFG_DIS_SYSTEM_ID_LEN_MAX                                                   (8)
#define BLE_CFG_DIS_MODEL_NUMBER_STRING_LEN_MAX                                         (32)
#define BLE_CFG_DIS_SERIAL_NUMBER_STRING_LEN_MAX                                        (32)
#define BLE_CFG_DIS_FIRMWARE_REVISION_STRING_LEN_MAX                                    (32)
#define BLE_CFG_DIS_HARDWARE_REVISION_STRING_LEN_MAX                                    (32)
#define BLE_CFG_DIS_SOFTWARE_REVISION_STRING_LEN_MAX                                    (32)
#define BLE_CFG_DIS_MANUFACTURER_NAME_STRING_LEN_MAX                                    (32)
#define BLE_CFG_DIS_IEEE_CERTIFICATION_LEN_MAX                                          (32)
#define BLE_CFG_DIS_PNP_ID_LEN_MAX                                                      (7)

/******************************************************************************
 * Heart Rate Service (HRS)
 ******************************************************************************/
#define BLE_CFG_HRS_NUMBER_OF_CUSTOM_CHAR    0 /**< Number of characteristic added by the user */
#define BLE_CFG_HRS_BODY_SENSOR_LOCATION_CHAR           1 /**< BODY SENSOR LOCATION CHARACTERISTIC */
#define BLE_CFG_HRS_ENERGY_EXPENDED_INFO_FLAG           1 /**< ENERGY EXTENDED INFO FLAG */
#define BLE_CFG_HRS_ENERGY_RR_INTERVAL_FLAG             1 /**< Max number of RR interval values - Shall not be greater than 9 */


/******************************************************************************
 * UTILITIES CONFIGURATION
 ******************************************************************************/

/******************************************************************************
 * TIMER SERVER
 *****************************************************************************/
/**
 * The user may define the maximum number of virtual timers supported.
 * It shall not exceed 255
 */
#define CFG_HW_TS_MAX_NBR_CONCURRENT_TIMER   6

/**
 * The user may define the priority in the NVIC of the RTC_WKUP interrupt handler that is used to manage the
 * wakeup timer.
 * This setting is the preemptpriority part of the NVIC.
 */
#define CFG_HW_TS_NVIC_RTC_WAKEUP_IT_PREEMPTPRIO   3

/**
 * The user may define the priority in the NVIC of the RTC_WKUP interrupt handler that is used to manage the
 * wakeup timer.
 * This setting is the subpriority part of the NVIC. It does not exist on all processors. When it is not supported
 * on the CPU, the setting is ignored
 */
#define CFG_HW_TS_NVIC_RTC_WAKEUP_IT_SUBPRIO   0

/**
 *  Define a critical section in the Timer server
 *  The Timer server does not support the API to be nested
 *  The  Application shall either:
 *    a) Ensure this will never happen
 *    b) Define the critical section
 *  The default implementations is masking all interrupts using the PRIMASK bit
 *  The TimerServer driver uses critical sections to avoid context corruption. This is achieved with the macro
 *  TIMER_ENTER_CRITICAL_SECTION and TIMER_EXIT_CRITICAL_SECTION. When CFG_HW_TS_USE_PRIMASK_AS_CRITICAL_SECTION is set
 *  to 1, all STM32 interrupts are masked with the PRIMASK bit of the CortexM CPU. It is possible to use the BASEPRI
 *  register of the CortexM CPU to keep allowed some interrupts with high priority. In that case, the user shall
 *  re-implement TIMER_ENTER_CRITICAL_SECTION and TIMER_EXIT_CRITICAL_SECTION and shall make sure that no TimerServer
 *  API are called when the TIMER critical section is entered
 */
#define CFG_HW_TS_USE_PRIMASK_AS_CRITICAL_SECTION   1

/**
   * This value shall reflect the maximum delay there could be in the application between the time the RTC interrupt
   * is generated by the Hardware and the time when the  RTC interrupt handler is called. This time is measured in
   * number of CFG_RTC_SYNCH_PRESCALER ticks.
   * A relax timing would be 1ms
   * When the value is too short, the timerserver will not be able to count properly and all timeout may be random.
   * When the value is too long, the device may wake up more often than the most optimal configuration. However, the
   * impact on power consumption would be marginal (unless the value selected is extremely too long). It is strongly
   * recommended to select a value large enough to make sure it is not too short to ensure reliability of the system
   * as this will have marginal impact on low power mode
   * The value below are calculated for RTCCLK coming from LSI (32Khz)
   */
#define CFG_HW_TS_RTC_HANDLER_MAX_DELAY   16  /**< 1ms x 32Khz / (CFG_RTC_ASYNCH_PRESCALER+1) */

  /**
   * Interrupt ID in the NVIC of the RTC Wakeup interrupt handler
   * It shall be type of IRQn_Type
   */
#define CFG_HW_TS_RTC_WAKEUP_HANDLER_ID   RTC_WKUP_IRQn

  /**
   * Calculated for RTCCLK coming from LSI (37Khz)
   * Define how much is divided the RTCCLK
   * Should be either 0,2,4,8,16
   *
   * Larger tick value is providing better power consumption
   */
#define CFG_RTCCLK_DIVIDER_CONF   0

  /**
   * Timer tick is 54us
   * When the 1Hz calendar clock is not needed, CFG_RTC_SYNCH_PRESCALER should be set to 0x7FFF (MAX VALUE)
   * When the RTC digital calibration is not used, CFG_RTC_ASYNCH_PRESCALER should be set to 1
   */
#if (CFG_RTCCLK_DIVIDER_CONF == 2)
#define CFG_RTC_WUCKSEL_DIVIDER (3)
#define CFG_RTC_ASYNCH_PRESCALER (3)
#define CFG_RTC_SYNCH_PRESCALER (0x2422)
  /**
   * Timer tick is 108us
   * When the 1Hz calendar clock is not needed, CFG_RTC_SYNCH_PRESCALER should be set to 0xFFFF
   */
#elif (CFG_RTCCLK_DIVIDER_CONF == 4)
#define CFG_RTC_WUCKSEL_DIVIDER (2)
#define CFG_RTC_ASYNCH_PRESCALER (3)
#define CFG_RTC_SYNCH_PRESCALER (0x2422)
  /**
   * Timer tick is 216us
   * When the 1Hz calendar clock is not needed, CFG_RTC_SYNCH_PRESCALER should be set to 0xFFFF
   */
#elif (CFG_RTCCLK_DIVIDER_CONF == 8)
#define CFG_RTC_WUCKSEL_DIVIDER (1) /**< Divided by 8 */
#define CFG_RTC_ASYNCH_PRESCALER (7)
#define CFG_RTC_SYNCH_PRESCALER (0x1211)
  /**
   * Timer tick is 432us
   * When the 1Hz calendar clock is not needed, CFG_RTC_SYNCH_PRESCALER should be set to 0xFFFF
   */
#elif (CFG_RTCCLK_DIVIDER_CONF == 16)
#define CFG_RTC_WUCKSEL_DIVIDER (0)
#define CFG_RTC_ASYNCH_PRESCALER (15)
#define CFG_RTC_SYNCH_PRESCALER (0x0908)
  /**
   * Custom configuration
   */
#else
#define CFG_RTC_WUCKSEL_DIVIDER (3)
#define CFG_RTC_ASYNCH_PRESCALER (1)
#define CFG_RTC_SYNCH_PRESCALER (0x7FFF)
#endif

