Rayling35/STM32Cube_FW_L4_V1.12.0/Projects/B-L475E-IOT01A/Applications/BLE/HeartRate/Inc/config.h
/******************************************************************************
 * SPI and other timing defines
 *****************************************************************************/
 
  /**
   * When the STM32xx runs too fast, there could be a false detection on the SPI_IRQ after a packet has been received.
   * To prevent this, a timeout is added to wait after receiving a packet from the BlueNRG before checking the SPI_IRQ.
   * When the fix is not implemented, the system is still working fine but it would result in some additional
   * communication over SPI which may increase the power consumption.
   */
#define SPI_END_RECEIVE_FIX             1

  /**
   * All timeout below are given in term of Ticks of the TimerServer.
   * The tick of the Timer Server depends on the LPO clock used as input and the
   * prescaler of the wakeup timer.
   * In order to get the most efficient implementation, the wakeuptimer prescaler should divide
   * the input clock by 2
   *
   * The values below are based on the LSI clock @37Kz.
   * For this, the tick is 54us
   */

  /**
   * It takes some time for the BlueNRG to wakeup upon request from the application before sending data.
   * To optimize the power consumption, a timeout is implemented to wait for the BlueNRG to wakeup.
   * The timeout prevents the application to send packet continuously to the BlueNRG as all these packets will be
   * rejected until it wakes up. The BlueNRG wakeup time depends on its activity. The timeout is calculated in number
   * of Timer Server tick. The default configuration is suitable to cover all use cases.
   */
#define SPI_TX_TIMEOUT                  6

  /**
   * This is the timeout related to the SPI_END_RECEIVE_FIX definition. The timeout is calculated in number of the
   * Timer Server tick. The worst case should be taken to cover all STM32 MCU families as it does not hurt if the timeout
   * is slightly longer than the minimum required. There should be no need to change the default value.
   */
#define SPI_END_RECEIVE_FIX_TIMEOUT     2

  /**
   * This setting shall be set to the size of the SPI FIFO RX. When there is no FIFO (STM32L0, …), it should be set to 1.
   * It is recommended to set it to the longest value implemented across STM32 MCU family to avoid error when porting
   * the FW across MCUs. A longer value than the minimum required has no impact on the system
   * Default configuration is 4 (Longest FIFO size known at this time – STM32L4).
   *
   */
#define SPI_FIFO_RX_DEPTH               4


   /**
   * This setting shall be set to the requirement of the BlueNRG device which is 1.5ms The timeout is calculated in
   * number of Timer Server tick. The worst case should be taken to cover all STM32 MCU families as it does not hurt
   * if the timeout is slightly longer than the minimum required. There should be no need to change the default value.
   */
#define BLUENRG_HOLD_TIME_IN_RESET      28

  /**
   * The CS shall be at least 625ns long. This setting shall be set to the number of cycles required to reach that value.
   * As there is almost no impact on the system, the highest value should be selected to cover all CPU speed used in
   * the application.
   * Default configuration is 52 (CPU @ 84Mhz – Max speed on STM32L4). *
   */
#define CS_PULSE_625NS_NBR_CYCLES_REQ   52

/******************************************************************************
 * MEMPOOL
 *****************************************************************************/
/**
 * Queue length of BLE Event
 * This parameter defines the number of asynchronous events that can be stored in the HCI layer before
 * being reported to the application. When a command is sent to the BlueNRG coprocessor, the HCI layer
 * is waiting for the event with the Num_HCI_Command_Packets set to 1. The receive queue shall be large
 * enough to store all asynchronous events received in between.
 * When CFG_TLBLE_MOST_EVENT_PAYLOAD_SIZE is set to 27, this allow to store three 255 bytes long asynchronous events
 * between the HCI command and its event.
 * This parameter depends on the value given to CFG_TLBLE_MOST_EVENT_PAYLOAD_SIZE. When the queue size is to small,
 * the system may hang if the queue is full with asynchronous events and the HCI layer is still waiting
 * for a CC/CS event, In that case, the notification TL_BLE_HCI_ToNot() is called to indicate
 * to the application a HCI command did not receive its command event within 30s (Default HCI Timeout).
 */
#define CFG_TLBLE_EVT_QUEUE_LENGTH      20

/**
 * This parameter should be set to fit most events received by the HCI layer. It defines the buffer size of each element
 * allocated in the queue of received events and can be used to optimize the amount of RAM allocated by the Memory Manager.
 * It should not exceed 255 which is the maximum HCI packet payload size (a greater value is a lost of memory as it will
 * never be used)
 * It shall be at least 4 to receive the command status event in one frame.
 * The default value is set to 27 to allow receiving an event of MTU size in a single buffer. This value maybe reduced
 * further depending on the application.
 *
 */
#define CFG_TLBLE_MOST_EVENT_PAYLOAD_SIZE   27

/******************************************************************************
 * LOW POWER MANAGER
 *****************************************************************************/
/**
 * Supported requester to the MCU Low Power Manager - can be increased up  to 32
 * It lits a bit mapping of all user of the Low Power Manager
 */
typedef enum
{
  LPM_SPI_TX_Id,
  LPM_SPI_RX_Id,
  CFG_LPM_HCI_CmdEvt,
  CFG_LPM_HCI_AsynchEvt,
  CFG_LPM_App,
  CFG_LPM_TS,
} CFG_LPM_Id_t;

/**
 * Stop Mode configuration
 */
typedef enum
{
  CFG_StopMode1_MR = LL_PWR_MODE_STOP0,
  CFG_StopMode1_LPR = LL_PWR_MODE_STOP1,
  CFG_StopMode2 = LL_PWR_MODE_STOP2
} CFG_StopModeConf_t;

/**
 * OFF Mode configuration
 */
typedef enum
{
  CFG_Standby = LL_PWR_MODE_STANDBY,
  CFG_Shutdown = LL_PWR_MODE_SHUTDOWN
} CFG_OffModeConf_t;

/******************************************************************************
 * HARDWARE CONFIGURATION
 ******************************************************************************/


/* Exported macros -----------------------------------------------------------*/
/* Compiler specific definition ----------------------------------------------*/
/*
 * Make sure the function (or variable) marked is part of the object file
 */
#if defined ( __CC_ARM )
#define USED                                               __attribute__((used))
#elif defined ( __ICCARM__ )
#define USED                                                              __root
#elif defined ( __GNUC__ )
#define USED                                               __attribute__((used))
#endif

#ifdef __cplusplus
}
#endif

#endif /*__CONFIG_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
